## Import libraries

In [1]:
import pandas as pd
import numpy as np
import os

## Import data

In [2]:
#shortcut to data files
path = r'C:\Users\Sreelaya Narla\Desktop\PYTHON\2025 Instacart Basket Analysis'

In [3]:
# Importing the customers dataframe
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [4]:
#checking dimensions
df_customers.shape

(206209, 10)

## Data wrangling
### question 4

In [5]:
# Checking the names of columns and first 5 rows

df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
#Fixing column names' inconsistencies:

df_customers.rename(columns = {
    'Surnam': 'Last_Name',
    'STATE' : 'State', 
    'date_joined' : 'Date Joined',
    'n_dependants': 'number of dependents',
    'fam_status' : 'Family Status', 
    'income' : 'Income'}, inplace = True)

In [7]:
# Checking the output
df_customers.head()

,user_id,First Name,Last_Name,Gender,State,Age,Date Joined,number of dependents,Family Status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
df_customers.rename(columns={'Last_Name': 'Last Name'}, inplace=True)

In [9]:
# Checking the output
df_customers.head()

,user_id,First Name,Last Name,Gender,State,Age,Date Joined,number of dependents,Family Status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
# Checking the data types
df_customers.dtypes

user_id                  int64
First Name              object
Last Name               object
Gender                  object
State                   object
Age                      int64
Date Joined             object
number of dependents     int64
Family Status           object
Income                   int64
dtype: object

In [11]:
# The data type of the user_id variable is integer. There will be no need to calculate stats for this variable (mean, min, max, etc.). 
# Therefore, I'll change it to the string data type

df_customers['user_id'] = df_customers['user_id'].astype('str')

In [12]:
# Checking the output:

df_customers['user_id'].dtype

dtype('O')

## Data consistency
### question 5

In [13]:
df_customers.describe()

                 Age  number of dependents         Income
count  206209.000000         206209.000000  206209.000000
mean       49.501646              1.499823   94632.852548
std        18.480962              1.118433   42473.786988
min        18.000000              0.000000   25903.000000
25%        33.000000              0.000000   59874.000000
50%        49.000000              1.000000   93547.000000
75%        66.000000              3.000000  124244.000000
max        81.000000              3.000000  593901.000000

In [14]:
# Checking whether the dataframe contains any mixed-type columns:
for col in df_customers.columns.tolist():
    weird = (df_customers[col].map(type) != type(df_customers[col].iloc[0]))
    if weird.any():
        print(col)

First Name
Age
number of dependents
Income

In [15]:
df_customers['First Name'] = df_customers['First Name'].astype(str)

# Convert to numeric (non-numeric entries will become NaN)
df_customers['Age'] = pd.to_numeric(df_customers['Age'], errors='coerce')

df_customers['number of dependents'] = pd.to_numeric(df_customers['number of dependents'], errors='coerce')

df_customers['Income'] = pd.to_numeric(df_customers['Income'], errors='coerce')

In [16]:
#verifying
for col in ['First Name', 'Age', 'number of dependents', 'Income']:
    print(f"{col}: {df_customers[col].dtype}")

First Name: object
Age: int64
number of dependents: int64
Income: int64

In [17]:
# Finding missing values
df_customers.isnull().sum()

user_id                 0
First Name              0
Last Name               0
Gender                  0
State                   0
Age                     0
Date Joined             0
number of dependents    0
Family Status           0
Income                  0
dtype: int64

In [18]:
# find any duplicates:
df_dups = df_customers[df_customers.duplicated()]

In [19]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, Date Joined, number of dependents, Family Status, Income]
Index: []

## Combining Data
### question 6

In [20]:
# Importing the prepared dataframe

ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'aggregated_ords_prods_merge.pkl'))

In [21]:
#chcecking dimensions
ords_prods_merge.shape

(32404859, 24)

In [22]:
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,busiest_day,busiest_days_summary,busiest_period_of_day,max_order,loyalty_flag,average_spend,spender_flag,Customer_frequency,frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Mid-range product,Regularly busy,Regular days,Average orders,10,New customer,6.367797,Low_spender,20.5,Non_frequent_customer
1,2539329,1,1,2,8,NaN,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,Mid-range product,Regularly busy,Regular days,Average orders,10,New customer,6.367797,Low_spender,20.5,Non_frequent_customer
2,2539329,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,...,Low-range product,Regularly busy,Regular days,Average orders,10,New customer,6.367797,Low_spender,20.5,Non_frequent_customer
3,2539329,1,1,2,8,NaN,26088,4,0,Aged White Cheddar Popcorn,...,Low-range product,Regularly busy,Regular days,Average orders,10,New customer,6.367797,Low_spender,20.5,Non_frequent_customer
4,2539329,1,1,2,8,NaN,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,Low-range product,Regularly busy,Regular days,Average orders,10,New customer,6.367797,Low_spender,20.5,Non_frequent_customer

In [23]:
# Making sure the data type matches the one of the customers df

ords_prods_merge['user_id'].dtype

dtype('int64')

In [26]:
# Converting the data type to string
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [25]:
#verifying
ords_prods_merge['user_id'].dtype

dtype('O')

In [27]:
#checking unqiue values
ords_prods_merge['user_id'].nunique()

206209

In [28]:
df_customers['user_id'].nunique()

206209

In [30]:
#Chosen method to combine both df: merging. The data frames differ in shape; however, they share a key column.
df_merging = ords_prods_merge.merge(df_customers, on='user_id', indicator='merging_status')

In [31]:
df_merging.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,First Name,Last Name,Gender,State,Age,Date Joined,number of dependents,Family Status,Income,merging_status
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2539329,1,1,2,8,NaN,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,2539329,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2539329,1,1,2,8,NaN,26088,4,0,Aged White Cheddar Popcorn,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,2539329,1,1,2,8,NaN,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [32]:
df_merging.shape

(32404859, 34)

In [33]:
df_merging['merging_status'].value_counts()

merging_status
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

## Export the data

In [34]:
df_merging.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'df_exercise_4_9.pkl'))